"""დავალება5) მომხმარებელს input-ის გამოყენებით შემოატანინეთ ორი რიცხვითი
მნიშვნელობა. შექმენით ჯამის ცვლადი ციკლის გარეთ რომლის საწყისი მნიშვნელობა იქნება 0. 
ციკლში start პოზიციად მომხმარებლის შემოტანილი რიცხვებიდან უმცირესი,
ხოლო end პოზიციად უდიდესი აიღეთ. ციკლის მუშაობისას საიტერაციო ცვლადის მნიშვნელობა 
გადაეცით ჯამის ცვლადს, რათა გაიგოთ ყველა ამ რიცხვის
 ჯამი. საბოლოოდ დაპრინტეთ ჯამი."""


first_number=int(input("please enter less number " ))
second_number=int(input("please enter gross number " ))

sum=0

for i in range(first_number, second_number + 1):
    sum=sum + i

print(sum)    
     