"""რომ გავიგოთ კონკრეტული მნიშვნელობა რა ტიპის არის ვიგებთ 
პრინტით print(type(5.2)) პასუხი გამოაქვს ტერმინალში"""

#print(type(5.2)) #ტერმინალში გამოიტანს პასუხს

# print(int(5.8)) ტერმინალში გამოიტანს 5 , 8-ს ჩამოაჭრის არ ამრგვალებს
#print(5 / 2) ტერმინალში პასუხს გამოიტანს 2.5 მთელ რიცვებზე მაგ 9/3 პასუხს გამოიტანს ათწილადშ 3.0

#print(5 // 2) ტერმინალში პასუხს გამოიტანს 2 
#ანუ ხუთში რამდენჯერ მოთავსდება 2 (მხოლოდ მთელ რიცხვს)

#print(5 % 2) ესეც გაყოფის ნიშანია ,მაგრამ ტერმინალში გამოიტანს ნაშთს ანუ 1

#ნებისმიერ ოპერაცია რაც არ უნდა გამოიყენო მთელ რიცხვზე თუ მეორე რიცხვი არის ათწილადი 
# შედეგი ყოველთვის არის ათწილადში

#print("Tamo" * 3) ტერმინალში გამოვა TamoTamoTamo

#შედარების ოპერატორი 
#> მეტობა, < ნაკლებობა , == ტოლობა, 
#ერთი ტოლობა = ნიშნავს მნიშვნელობის მინიჭებას.

#ერთმაგ ბრჭყალს სტრინგიში იყენებენ ერთი სიმბოლოს დრო მაგ: 's' -ეწოდება ჩარი
#როდესაც გვაქვს სიმბოლოების ერთობლიობა მაშინ ორმაგ ბრჭყალს "computer"
