"""დაწერეთ პროგრამა, რომელიც მომხმარებელს შეეკითხება მის სახელს, ასაკს და გვარს,
და დაუპრინტავს ამ ინფორმაციას ერთ დიდ წინადადებაში"""

name=input("what is your name? : ")
surname=input("What is your surname? : ")
age=input("How old are you? :")
print("your name is " + name + " your surname is " + surname + " your age is " + age)


"""age-ში 41- ს ინახავს ტრინგად
 ამიტომ შესაძლებელია print-ში მივანიჭოთ ინტეჯერის ფუნქცია, როდესაც გვინდა რამე რიცხვის დამატება
print(int(age)+5)
როგორც მათემატიკური რიცხვი ასაკის გამოძახება შესაძლებელია ბევრჯერ 
დაგვჭირდეს და ამ პრინტის ფუნქციის დაწერა ბევრჯერ რომ არ მოგვიაწიოს რადგან
 ანელებს მუშაობას პროგრამის, ამიტომ age-ს ფუნქცია შემიძლია ჩავსვა ინტეჯერში  age=int(input("How old are you? :"))"""